truongbui692002/sdk5_17_0_2/nRF5_SDK_17.0.2_d674dde/examples/peripheral/02_softTimer/main.c

#include <stdbool.h>
#include <stdint.h>
#include "nrf_delay.h"
#include "boards.h"

#include "nrf52_gpio.h"

#include "app_timer.h"
#include "nrf_drv_clock.h"
#include "nrf_sortlist.h"


APP_TIMER_DEF(m_repeated_timer_id);     /**< Handler for repeated timer used to blink LED 1. */


static void lfclk_request(void)
{
    ret_code_t err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);
    nrf_drv_clock_lfclk_request(NULL);
}

static void repeated_timer_handler(void * p_context)
{
    nrf52_toggle(15);
}

static void create_timers()
{
    ret_code_t err_code;

    // Create timers
    err_code = app_timer_create(&m_repeated_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                repeated_timer_handler);
    APP_ERROR_CHECK(err_code);
}

int main(void)
{
	ret_code_t      err_code;
	
	nrf52_output_creat(15);
	nrf52_output_set_level(15, 0);
	
	lfclk_request();
	app_timer_init();
	
	create_timers();
	
	err_code = app_timer_start(m_repeated_timer_id, APP_TIMER_TICKS(200), NULL);
  APP_ERROR_CHECK(err_code);
	
    while (true)
    {

    }
}

